motivation/responsiveness/latency-sensitive/cycle/period-100ms/multi.log
This is ApacheBench, Version 2.3 <$Revision: 1706008 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 147.46.240.226 (be patient)


Server Software:        Apache-Coyote/1.1
Server Hostname:        147.46.240.226
Server Port:            8080

Document Path:          /examples/servlets/nonblocking/numberwriter
Document Length:        210000 bytes

Concurrency Level:      100
Time taken for tests:   5.710 seconds
Complete requests:      500
Failed requests:        2
   (Connect: 0, Receive: 0, Length: 2, Exceptions: 0)
Total transferred:      105087384 bytes
HTML transferred:       105016384 bytes
Requests per second:    87.57 [#/sec] (mean)
Time per request:       1141.904 [ms] (mean)
Time per request:       11.419 [ms] (mean, across all concurrent requests)
Transfer rate:          17974.25 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    1   0.7      0       3
Processing:    72 1099 576.9   1001    2874
Waiting:        1  706 559.8    602    2515
Total:         73 1100 576.8   1002    2875
WARNING: The median and mean for the initial connection time are not within a normal deviation
        These results are probably not that reliable.

Percentage of the requests served within a certain time (ms)
  50%   1002
  66%   1295
  75%   1470
  80%   1624
  90%   1961
  95%   2146
  98%   2352
  99%   2508
 100%   2875 (longest request)